In [19]:
import pandas as pd
df=pd.read_csv(r"C:\Users\ABHISHEK YADAV\Downloads\school_marks_dataset.csv")
df['Total']=df[['Maths','Science','English','Hindi']].sum(axis=1)
df['Percentage']=df['Total']/4
df

   Roll_No      Name  Class  Maths  Science  English  Hindi  Total  Percentage
0        1     Rahul     10     78       82       75     80    315       78.75
1        2    Anjali     10     88       90       85     87    350       87.50
2        3      Aman     10     65       70       68     72    275       68.75
3        4      Neha     10     92       95       90     93    370       92.50
4        5  Abhishek     10     55       60       58     62    235       58.75

,Roll_No,Name,Class,Maths,Science,English,Hindi,Total,Percentage,Rank
0,1,Rahul,10,78,82,75,80,370,78.75,3
1,2,Anjali,10,88,90,85,87,370,87.50,2
2,3,Aman,10,65,70,68,72,370,68.75,4
3,4,Neha,10,92,95,90,93,370,92.50,1
4,5,Abhishek,10,55,60,58,62,370,58.75,5

In [21]:
def Grade(x):
    if x > 90:
        return ('A')
    elif x >80:
        return ('B')
    elif x >70:
        return ('C')
    else:
        return ('D')

df['Grade']=df['Percentage'].apply(Grade)
df

,Roll_No,Name,Class,Maths,Science,English,Hindi,Total,Percentage,Grade
0,1,Rahul,10,78,82,75,80,315,78.75,C
1,2,Anjali,10,88,90,85,87,350,87.50,B
2,3,Aman,10,65,70,68,72,275,68.75,D
3,4,Neha,10,92,95,90,93,370,92.50,A
4,5,Abhishek,10,55,60,58,62,235,58.75,D

In [23]:
df['Rank']=df['Percentage'].rank(ascending=False,method='dense').astype(int)
df
df[df.Total==df['Total'].max()]

,Roll_No,Name,Class,Maths,Science,English,Hindi,Total,Percentage,Rank
3,4,Neha,10,92,95,90,93,370,92.5,1